RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_timer.c
/*!
    \brief      configure TIMER break function (API_ID(0x001EU))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  breakpara: TIMER break parameter struct
                  runoffstate: TIMER_ROS_STATE_ENABLE, TIMER_ROS_STATE_DISABLE
                  ideloffstate: TIMER_IOS_STATE_ENABLE, TIMER_IOS_STATE_DISABLE
                  deadtime: 0~255
                  outputautostate: TIMER_OUTAUTO_ENABLE, TIMER_OUTAUTO_DISABLE
                  protectmode: TIMER_CCHP_PROT_OFF, TIMER_CCHP_PROT_0, TIMER_CCHP_PROT_1, TIMER_CCHP_PROT_2
                  break0state: TIMER_BREAK0_ENABLE, TIMER_BREAK0_DISABLE
                  break0filter: 0~15
                  break0polarity: TIMER_BREAK0_POLARITY_LOW, TIMER_BREAK0_POLARITY_HIGH
                  break0lock: TIMER_BREAK0_LK_ENABLE, TIMER_BREAK0_LK_DISABLE
                  break0release: TIMER_BREAK0_RELEASE, TIMER_BREAK0_UNRELEASE
                  break1state: TIMER_BREAK1_ENABLE, TIMER_BREAK1_DISABLE
                  break1filter: 0~15
                  break1polarity: TIMER_BREAK1_POLARITY_LOW, TIMER_BREAK1_POLARITY_HIGH
                  break1lock: TIMER_BREAK1_LK_ENABLE, TIMER_BREAK1_LK_DISABLE
                  break1release: TIMER_BREAK1_RELEASE, TIMER_BREAK1_UNRELEASE
                  channelbreakstate: TIMER_CH_BREAK_DISABLE, TIMER_CH_BREAK_ENABLE
                  channelbreakpolarity: TIMER_CH_BREAK_POLARITY_LOW, TIMER_CH_BREAK_POLARITY_HIGH
    \param[out] none
    \retval     none
*/
void timer_break_config(uint32_t timer_periph, timer_break_parameter_struct *breakpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(breakpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph)) {
            TIMER_CCHP(timer_periph) = (uint32_t)(((uint32_t)(breakpara->runoffstate & TIMER_CCHP_ROS)) |
                                                  ((uint32_t)(breakpara->ideloffstate & TIMER_CCHP_IOS)) |
                                                  ((uint32_t)(breakpara->deadtime & TIMER_CCHP_DTCFG)) |
                                                  ((uint32_t)(breakpara->outputautostate & TIMER_CCHP_OAEN)) |
                                                  ((uint32_t)(breakpara->protectmode & TIMER_CCHP_PROT)) |
                                                  ((uint32_t)(breakpara->break0state & TIMER_CCHP_BRK0EN)) |
                                                  (((uint32_t)(breakpara->break0filter) << 16U) & TIMER_CCHP_BRK0F) |
                                                  ((uint32_t)(breakpara->break0polarity & TIMER_CCHP_BRK0P)) |
                                                  ((uint32_t)(breakpara->break0lock & TIMER_CCHP_BRK0LK)) |
                                                  ((uint32_t)(breakpara->break0release & TIMER_CCHP_BRK0REL)) |
                                                  ((uint32_t)(breakpara->break1state & TIMER_CCHP_BRK1EN)) |
                                                  (((uint32_t)(breakpara->break1filter) << 20U) & TIMER_CCHP_BRK1F) |
                                                  ((uint32_t)(breakpara->break1polarity & TIMER_CCHP_BRK1P)) |
                                                  ((uint32_t)(breakpara->break1lock & TIMER_CCHP_BRK1LK)) |
                                                  ((uint32_t)(breakpara->break1release & TIMER_CCHP_BRK1REL)) |
                                                  ((uint32_t)(breakpara->channelbreakstate & TIMER_CCHP_CHBRKEN)) |
                                                  ((uint32_t)(breakpara->channelbreakpolarity & TIMER_CCHP_CHBRKP)));
        } else if((TIMER14 == timer_periph) || (TIMER15 == timer_periph) || (TIMER16 == timer_periph) || (TIMER40 == timer_periph) || \
                  (TIMER41 == timer_periph) || (TIMER42 == timer_periph) || (TIMER43 == timer_periph) || (TIMER44 == timer_periph)) {
            TIMER_CCHP(timer_periph) = (uint32_t)(((uint32_t)(breakpara->runoffstate & TIMER_CCHP_ROS)) |
                                                  ((uint32_t)(breakpara->ideloffstate & TIMER_CCHP_IOS)) |
                                                  ((uint32_t)(breakpara->deadtime & TIMER_CCHP_DTCFG)) |
                                                  ((uint32_t)(breakpara->outputautostate & TIMER_CCHP_OAEN)) |
                                                  ((uint32_t)(breakpara->protectmode & TIMER_CCHP_PROT)) |
                                                  ((uint32_t)(breakpara->break0state & TIMER_CCHP_BRK0EN)) |
                                                  (((uint32_t)(breakpara->break0filter) << 16U) & TIMER_CCHP_BRK0F) |
                                                  ((uint32_t)(breakpara->break0polarity & TIMER_CCHP_BRK0P)) |
                                                  ((uint32_t)(breakpara->break0lock & TIMER_CCHP_BRK0LK)) |
                                                  ((uint32_t)(breakpara->break0release & TIMER_CCHP_BRK0REL)));
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable TIMER break function (API_ID(0x001FU))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signals, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BREAK1: BREAK1 input signals, TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_break_enable(uint32_t timer_periph, uint16_t break_num)
{
    if(TIMER_BREAK0 == break_num) {
        TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK0EN;
    } else if(TIMER_BREAK1 == break_num) {
        TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK1EN;
    } else {
    }
}

/*!
    \brief      disable TIMER break function (API_ID(0x0020U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signals, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BREAK1: BREAK1 input signals, TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_break_disable(uint32_t timer_periph, uint16_t break_num)
{
    if(TIMER_BREAK0 == break_num) {
        TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_BRK0EN);
    } else if(TIMER_BREAK1 == break_num) {
        TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_BRK1EN);
    } else {
    }
}

/*!
    \brief      enable TIMER output automatic function (API_ID(0x0021U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[out] none
    \retval     none
*/
void timer_automatic_output_enable(uint32_t timer_periph)
{
    TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_OAEN;
}

/*!
    \brief      disable TIMER output automatic function (API_ID(0x0022U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[out] none
    \retval     none
*/
void timer_automatic_output_disable(uint32_t timer_periph)
{
    TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_OAEN);
}

/*!
    \brief      configure TIMER primary output function (API_ID(0x0023U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_primary_output_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_POEN;
    } else {
        TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_POEN);
    }
}

/*!
    \brief      configure channel commutation control shadow register (API_ID(0x0024U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_control_shadow_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_CCSE;
    } else {
        TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCSE);
    }
}

/*!
    \brief      configure TIMER channel control shadow register update control (API_ID(0x0025U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  ccuctl: channel control shadow register update control
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATECTL_CCU: the shadow registers update by when CMTG bit is set
      \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers update by when CMTG bit is set or an rising edge of TRGI occurs
      \arg        TIMER_UPDATECTL_CCUOVER: the shadow registers update by when the overflow event occurs
      \arg        TIMER_UPDATECTL_CCUUNDER: the shadow registers update by when the underflow event occurs
      \arg        TIMER_UPDATECTL_CCUOVERUNDER: the shadow registers update by when the overflow or underflow event occurs
    \param[out] none
    \retval     none
*/
void timer_channel_control_shadow_update_config(uint32_t timer_periph, uint32_t ccuctl)
{
    TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCUC);
    TIMER_CTL1(timer_periph) |= (uint32_t)(ccuctl & TIMER_CTL1_CCUC);
}

/*!
    \brief      initialize TIMER channel output parameter struct with a default value (API_ID(0x0026U))
    \param[in]  ocpara: TIMER channel n output parameter struct
    \param[out] none
    \retval     none
*/
void timer_channel_output_struct_para_init(timer_oc_parameter_struct *ocpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ocpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0026U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the channel output parameter struct member with the default value */
        ocpara->outputstate  = TIMER_CCX_DISABLE;
        ocpara->outputnstate = TIMER_CCXN_DISABLE;
        ocpara->ocpolarity   = TIMER_OC_POLARITY_HIGH;
        ocpara->ocnpolarity  = TIMER_OCN_POLARITY_HIGH;
        ocpara->ocidlestate  = TIMER_OC_IDLE_STATE_LOW;
        ocpara->ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
    }
}

/*!
    \brief      configure TIMER channel output function (API_ID(0x0027U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,22,23,30,31,40~44)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,22,23,30,31,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23,30,31))
    \param[in]  ocpara: TIMER channel output parameter struct
                  outputstate: TIMER_CCX_ENABLE, TIMER_CCX_DISABLE
                  outputnstate: TIMER_CCXN_ENABLE, TIMER_CCXN_DISABLE
                  ocpolarity: TIMER_OC_POLARITY_HIGH, TIMER_OC_POLARITY_LOW
                  ocnpolarity: TIMER_OCN_POLARITY_HIGH, TIMER_OCN_POLARITY_LOW
                  ocidlestate: TIMER_OC_IDLE_STATE_LOW, TIMER_OC_IDLE_STATE_HIGH
                  ocnidlestate: TIMER_OCN_IDLE_STATE_LOW, TIMER_OCN_IDLE_STATE_HIGH
    \param[out] none
    \retval     none
*/
void timer_channel_output_config(uint32_t timer_periph, uint16_t channel, timer_oc_parameter_struct *ocpara)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        /* reset the CH0EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
        /* set the CH0EN bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(ocpara->outputstate & TIMER_CHCTL2_CH0EN);
        /* reset the CH0P bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0P);
        /* set the CH0P bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(ocpara->ocpolarity & TIMER_CHCTL2_CH0P);

        if((TIMER0  == timer_periph) || (TIMER7  == timer_periph) || (TIMER14 == timer_periph) || (TIMER15 == timer_periph) || \
                (TIMER16 == timer_periph) || (TIMER40 == timer_periph) || (TIMER41 == timer_periph) || (TIMER42 == timer_periph) || \
                (TIMER43 == timer_periph) || (TIMER44 == timer_periph)) {

            /* reset the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
            /* set the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(ocpara->outputnstate & TIMER_CHCTL2_MCH0EN);

            /* reset the MCH0P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0P);
            /* set the MCH0P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(ocpara->ocnpolarity & TIMER_CHCTL2_MCH0P);

