RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_timer.c
            /* reset the ISO0 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO0);
            /* set the ISO0 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(ocpara->ocidlestate & TIMER_CTL1_ISO0);

            /* reset the ISO0N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO0N);
            /* set the ISO0N bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(ocpara->ocnidlestate & TIMER_CTL1_ISO0N);
        }
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        /* reset the CH1EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
        /* set the CH1EN bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->outputstate) << 4U) & TIMER_CHCTL2_CH1EN);
        /* reset the CH1P bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1P);
        /* set the CH1P bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocpolarity) << 4U) & TIMER_CHCTL2_CH1P);

        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph)) {
            /* reset the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1EN);
            /* set the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->outputnstate) << 4U) & TIMER_CHCTL2_MCH1EN);
            /* reset the MCH1P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1P);
            /* set the MCH1P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnpolarity) << 4U) & TIMER_CHCTL2_MCH1P);
            /* reset the ISO1 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1);
            /* set the ISO1 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocidlestate) << 2U) & TIMER_CTL1_ISO1);
            /* reset the ISO1N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1N);
            /* set the ISO1N bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnidlestate) << 2U) & TIMER_CTL1_ISO1N);
        }

        if((TIMER14 == timer_periph) || (TIMER40 == timer_periph) || (TIMER41 == timer_periph) || (TIMER42 == timer_periph) || \
                (TIMER43 == timer_periph) || (TIMER44 == timer_periph)) {
            /* reset the ISO1 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1);
            /* set the ISO1 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocidlestate) << 2U) & TIMER_CTL1_ISO1);
        }

        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        /* reset the CH2EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2EN);
        /* set the CH2EN bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->outputstate) << 8U) & TIMER_CHCTL2_CH2EN);
        /* reset the CH2P bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2P);
        /* set the CH2P bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocpolarity) << 8U) & TIMER_CHCTL2_CH2P);

        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph)) {
            /* reset the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2EN);
            /* set the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->outputnstate) << 8U) & TIMER_CHCTL2_MCH2EN);
            /* reset the MCH2P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2P);
            /* set the MCH2P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnpolarity) << 8U) & TIMER_CHCTL2_MCH2P);
            /* reset the ISO2 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2);
            /* set the ISO2 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocidlestate) << 4U) & TIMER_CTL1_ISO2);
            /* reset the ISO2N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2N);
            /* set the ISO2N bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnidlestate) << 4U) & TIMER_CTL1_ISO2N);
        }
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2MS);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        /* reset the CH3EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3EN);
        /* set the CH3EN bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->outputstate) << 12U) & TIMER_CHCTL2_CH3EN);
        /* reset the CH3P bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3P);
        /* set the CH3P bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocpolarity) << 12U) & TIMER_CHCTL2_CH3P);

        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph)) {
            /* reset the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3EN);
            /* set the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->outputnstate) << 12U) & TIMER_CHCTL2_MCH3EN);
            /* reset the MCH3P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3P);
            /* set the MCH3P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnpolarity) << 12U) & TIMER_CHCTL2_MCH3P);
            /* reset the ISO3 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO3);
            /* set the ISO3 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocidlestate) << 6U) & TIMER_CTL1_ISO3);
            /* reset the ISO3N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO3N);
            /* set the ISO3N bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnidlestate) << 6U) & TIMER_CTL1_ISO3N);
        }
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3MS);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output compare mode (API_ID(0x0028U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,22,23,30,31,40~44)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,22,23,30,31,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,14~16,40~44))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7))
    \param[in]  ocmode: channel output compare mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_MODE_TIMING: timing mode
      \arg        TIMER_OC_MODE_ACTIVE: active mode
      \arg        TIMER_OC_MODE_INACTIVE: inactive mode
      \arg        TIMER_OC_MODE_TOGGLE: toggle mode
      \arg        TIMER_OC_MODE_LOW: force low mode
      \arg        TIMER_OC_MODE_HIGH: force high mode
      \arg        TIMER_OC_MODE_PWM0: PWM mode 0
      \arg        TIMER_OC_MODE_PWM1: PWM mode 1
      \arg        TIMER_OC_MODE_DSPM0: delayable SPM mode 0 (TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_OC_MODE_DSPM1: delayable SPM mode 1 (TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_OC_MODE_ASYMMETRIC_PWM0: Asymmetric PWM mode 0 (TIMERx(x=0,7), TIMER_CH_x(x=0~3))
      \arg        TIMER_OC_MODE_ASYMMETRIC_PWM1: Asymmetric PWM mode 1 (TIMERx(x=0,7), TIMER_CH_x(x=0~3))
    \param[out] none
    \retval     none
*/
void timer_channel_output_mode_config(uint32_t timer_periph, uint16_t channel, uint32_t ocmode)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMCTL);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(ocmode & TIMER_CHCTL0_CH0COMCTL);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMCTL);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(ocmode) << 8U) & TIMER_CHCTL0_CH1COMCTL);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMCTL);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(ocmode & TIMER_CHCTL1_CH2COMCTL);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMCTL);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocmode) << 8U) & TIMER_CHCTL1_CH3COMCTL);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMCTL);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)(ocmode & TIMER_MCHCTL0_MCH0COMCTL);
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMCTL);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(ocmode) << 8U) & TIMER_MCHCTL0_MCH1COMCTL);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMCTL);
        TIMER_MCHCTL1(timer_periph) |= (uint32_t)(ocmode & TIMER_MCHCTL1_MCH2COMCTL);
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMCTL);
        TIMER_MCHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocmode) << 8U) & TIMER_MCHCTL1_MCH3COMCTL);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output pulse value (API_ID(0x0029U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,22,23,30,31,40~44)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,22,23,30,31,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,14~16,40~44))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7))
    \param[in]  pulse: channel output pulse value
    \param[out] none
    \retval     none
*/
void timer_channel_output_pulse_value_config(uint32_t timer_periph, uint16_t channel, uint32_t pulse)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CH0CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CH1CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CH2CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CH3CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCH0CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCH1CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCH2CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCH3CV(timer_periph) = (uint32_t)pulse;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output shadow function (API_ID(0x002AU))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,22,23,30,31,40~44)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,22,23,30,31,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,14~16,40~44))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7))
    \param[in]  ocshadow: channel output compare shadow
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_SHADOW_ENABLE: channel output compare shadow enable
      \arg        TIMER_OC_SHADOW_DISABLE: channel output compare shadow disable
      \arg        TIMER_OMC_SHADOW_ENABLE: multi mode channel output compare shadow enable
      \arg        TIMER_OMC_SHADOW_DISABLE: multi mode channel output compare shadow disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMSEN);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)ocshadow & TIMER_CHCTL0_CH0COMSEN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMSEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 8U) & TIMER_CHCTL0_CH1COMSEN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMSEN);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)ocshadow & TIMER_CHCTL1_CH2COMSEN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMSEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 8U) & TIMER_CHCTL1_CH3COMSEN);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMSEN);
        TIMER_MCHCTL0(timer_periph) |= ((uint32_t)ocshadow & TIMER_MCHCTL0_MCH0COMSEN);
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMSEN);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 8U) & TIMER_MCHCTL0_MCH1COMSEN);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMSEN);
        TIMER_MCHCTL1(timer_periph) |= ((uint32_t)ocshadow & TIMER_MCHCTL1_MCH2COMSEN);
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMSEN);
        TIMER_MCHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 8U) & TIMER_MCHCTL1_MCH3COMSEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output clear function (API_ID(0x002BU))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,22,23,30,31,40~44)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,22,23,30,31,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,14~16,40~44))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7))
    \param[in]  occlear: channel output clear function
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_CLEAR_ENABLE: channel output clear function enable
      \arg        TIMER_OC_CLEAR_DISABLE: channel output clear function disable
      \arg        TIMER_OMC_CLEAR_ENABLE: multi mode channel output clear function enable
      \arg        TIMER_OMC_CLEAR_DISABLE: multi mode channel output clear function disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_clear_config(uint32_t timer_periph, uint16_t channel, uint16_t occlear)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMCEN);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)occlear & TIMER_CHCTL0_CH0COMCEN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMCEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)occlear << 8U) & TIMER_CHCTL0_CH1COMCEN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMCEN);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)occlear & TIMER_CHCTL1_CH2COMCEN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMCEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)occlear << 8U) & TIMER_CHCTL1_CH3COMCEN);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMCEN);
        TIMER_MCHCTL0(timer_periph) |= ((uint32_t)occlear & TIMER_MCHCTL0_MCH0COMCEN);
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMCEN);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)(((uint32_t)occlear << 8U) & TIMER_MCHCTL0_MCH1COMCEN);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMCEN);
        TIMER_MCHCTL1(timer_periph) |= ((uint32_t)occlear & TIMER_MCHCTL1_MCH2COMCEN);
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMCEN);
        TIMER_MCHCTL1(timer_periph) |= (uint32_t)(((uint32_t)occlear << 8U) & TIMER_MCHCTL1_MCH3COMCEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output polarity (API_ID(0x002CU))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,22,23,30,31,40~44)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,22,23,30,31,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,14~16,40~44))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7))
    \param[in]  ocpolarity: channel output polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_POLARITY_HIGH: channel output polarity is high
      \arg        TIMER_OC_POLARITY_LOW: channel output polarity is low
      \arg        TIMER_OMC_POLARITY_HIGH: multi mode channel output polarity is high
      \arg        TIMER_OMC_POLARITY_LOW: multi mode channel output polarity is low
    \param[out] none
    \retval     none
*/
void timer_channel_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocpolarity)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0P);
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)ocpolarity & TIMER_CHCTL2_CH0P);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 4U) & TIMER_CHCTL2_CH1P);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 8U) & TIMER_CHCTL2_CH2P);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 12U) & TIMER_CHCTL2_CH3P);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH0FP);
        TIMER_MCHCTL2(timer_periph) |= ((uint32_t)ocpolarity & TIMER_MCHCTL2_MCH0FP);
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH1FP);
        TIMER_MCHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 2U) & TIMER_MCHCTL2_MCH1FP);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH2FP);
        TIMER_MCHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 4U) & TIMER_MCHCTL2_MCH2FP);
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH3FP);
        TIMER_MCHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 6U) & TIMER_MCHCTL2_MCH3FP);
        break;
    default:
        break;
    }
}

