RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_timer.c
            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2MS);
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_CTL2(timer_periph) &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << 26U));
            TIMER_CTL2(timer_periph) |= (uint32_t)(((uint32_t)omcpara->outputmode & (uint32_t)TIMER_MCH_MODE_MASK)  << 26U);
            /* reset the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3EN);
            /* set the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->outputstate) << 12U) & TIMER_CHCTL2_MCH3EN);
            /* reset the MCH3FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH3FP);
            /* set the MCH3FP bit */
            TIMER_MCHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->ocpolarity) << 6U) & TIMER_MCHCTL2_MCH3FP);

            TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3MS);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      multi mode channel mode select (API_ID(0x003AU))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,14~16,40~44))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7))
    \param[in]  multi_mode_sel: multi mode channel mode selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MCH_MODE_INDEPENDENTLY: multi mode channel work in independently mode
      \arg        TIMER_MCH_MODE_COMPLEMENTARY: multi mode channel work in complementary output mode
    \param[out] none
    \retval     none
*/
void timer_multi_mode_channel_mode_config(uint32_t timer_periph, uint32_t channel, uint32_t multi_mode_sel)
{
    uint32_t reg;
    reg = TIMER_CTL2(timer_periph);

    reg &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << (((channel & 0xFU) << 1U) + 20U)));
    reg |= (uint32_t)((multi_mode_sel & TIMER_MCH_MODE_MASK) << (((channel & 0xFU) << 1U) + 20U));

    TIMER_CTL2(timer_periph) = reg;
}

/*!
    \brief      select TIMER input trigger source (API_ID(0x003BU))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,30,31,40~44)
    \param[in]  intrigger: input trigger source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_ITI0: internal trigger 0(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_SMCFG_TRGSEL_ITI1: internal trigger 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_SMCFG_TRGSEL_ITI2: internal trigger 2(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_SMCFG_TRGSEL_ITI3: internal trigger 3(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_SMCFG_TRGSEL_CI0F_ED: TI0 edge detector(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_SMCFG_TRGSEL_CI0FE0: filtered channel 0 input(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_SMCFG_TRGSEL_CI1FE1: filtered channel 1 input(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_SMCFG_TRGSEL_ETIFP: filtered external trigger input(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_SMCFG_TRGSEL_CI2FE2: filtered channel 2 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_CI3FE3: filtered channel 3 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_MCI0FEM0: filtered multi mode channel 0 input(TIMERx(x=0,7,14,40~44))
      \arg        TIMER_SMCFG_TRGSEL_MCI1FEM1: filtered multi mode channel 1 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_MCI2FEM2: filtered multi mode channel 2 input(TIMERx(x=0,7))
      \arg        TIMER_SMCFG_TRGSEL_MCI3FEM3: filtered multi mode channel 3 input(TIMERx(x=0,7))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI4: internal trigger 4 for General-L0 timer(TIMERx(x=1,2,22,23,30,31))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI5: internal trigger 5 for General-L0 timer(TIMERx(x=1,22,23,30))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI7: internal trigger 7 for General-L0 timer(TIMERx(x=4))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI9: internal trigger 9 for General-L0 timer(TIMERx(x=22,23))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI10: internal trigger 10 for General-L0 timer(TIMERx(x=22,23))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI11: internal trigger 11 for General-L0 timer(TIMERx(x=22,23))
      \arg        TIMER_SMCFG_TRGSEL_ITI12: internal trigger 12(TIMERx(x=0~4,7,23,30,31))
      \arg        TIMER_SMCFG_TRGSEL_ITI13: internal trigger 13(TIMERx(x=0~4,7,22,30,31))
      \arg        TIMER_SMCFG_TRGSEL_ITI14: internal trigger 14(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
    \param[out] none
    \retval     none
*/
void timer_input_trigger_source_select(uint32_t timer_periph, uint32_t intrigger)
{
    uint8_t TIMERx_temp = 0U;
    uint32_t TIMERxCFG_temp = 0U;
    volatile uint32_t *TIMERxCFG_addr = NULL;
    uint8_t i = 0U;
    uint32_t TIMERxCFG0_value, TIMERxCFG1_value, TIMERxCFG2_value;

    switch(timer_periph) {
    case TIMER0:
        TIMERx_temp = SYSCFG_TIMER0;
        break;
    case TIMER1:
        TIMERx_temp = SYSCFG_TIMER1;
        break;
    case TIMER2:
        TIMERx_temp = SYSCFG_TIMER2;
        break;
    case TIMER3:
        TIMERx_temp = SYSCFG_TIMER3;
        break;
    case TIMER4:
        TIMERx_temp = SYSCFG_TIMER4;
        break;
    case TIMER7:
        TIMERx_temp = SYSCFG_TIMER7;
        break;
    case TIMER14:
        TIMERx_temp = SYSCFG_TIMER14;
        break;
    case TIMER22:
        TIMERx_temp = SYSCFG_TIMER22;
        break;
    case TIMER23:
        TIMERx_temp = SYSCFG_TIMER23;
        break;
    case TIMER30:
        TIMERx_temp = SYSCFG_TIMER30;
        break;
    case TIMER31:
        TIMERx_temp = SYSCFG_TIMER31;
        break;
    case TIMER40:
        TIMERx_temp = SYSCFG_TIMER40;
        break;
    case TIMER41:
        TIMERx_temp = SYSCFG_TIMER41;
        break;
    case TIMER42:
        TIMERx_temp = SYSCFG_TIMER42;
        break;
    case TIMER43:
        TIMERx_temp = SYSCFG_TIMER43;
        break;
    case TIMER44:
        TIMERx_temp = SYSCFG_TIMER44;
        break;
    default:
        break;
    }

