RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_timer.c
    switch(timer_periph) {
    case TIMER0:
        TIMERx_temp = SYSCFG_TIMER0;
        break;
    case TIMER1:
        TIMERx_temp = SYSCFG_TIMER1;
        break;
    case TIMER2:
        TIMERx_temp = SYSCFG_TIMER2;
        break;
    case TIMER3:
        TIMERx_temp = SYSCFG_TIMER3;
        break;
    case TIMER4:
        TIMERx_temp = SYSCFG_TIMER4;
        break;
    case TIMER7:
        TIMERx_temp = SYSCFG_TIMER7;
        break;
    case TIMER14:
        TIMERx_temp = SYSCFG_TIMER14;
        break;
    case TIMER22:
        TIMERx_temp = SYSCFG_TIMER22;
        break;
    case TIMER23:
        TIMERx_temp = SYSCFG_TIMER23;
        break;
    case TIMER30:
        TIMERx_temp = SYSCFG_TIMER30;
        break;
    case TIMER31:
        TIMERx_temp = SYSCFG_TIMER31;
        break;
    case TIMER40:
        TIMERx_temp = SYSCFG_TIMER40;
        break;
    case TIMER41:
        TIMERx_temp = SYSCFG_TIMER41;
        break;
    case TIMER42:
        TIMERx_temp = SYSCFG_TIMER42;
        break;
    case TIMER43:
        TIMERx_temp = SYSCFG_TIMER43;
        break;
    case TIMER44:
        TIMERx_temp = SYSCFG_TIMER44;
        break;
    default:
        break;
    }

    /* read SYSCFG_TIMERCFG0 register value */
    TIMERxCFG0_value = SYSCFG_TIMERCFG0(TIMERx_temp) & 0x7FFF7FFFU;
    /* read SYSCFG_TIMERCFG1 register value */
    TIMERxCFG1_value = SYSCFG_TIMERCFG1(TIMERx_temp) & 0x7FFF03FFU;
    /* read SYSCFG_TIMERCFG2 register value */
    TIMERxCFG2_value = SYSCFG_TIMERCFG2(TIMERx_temp) & 0x001F7FFFU;

    if((0U == TIMERxCFG0_value) && (0U == TIMERxCFG1_value) && (0U == TIMERxCFG2_value)) {
        if(slavemode <= 2U) {
            TIMERxCFG_temp = (uint32_t)0x1F << (slavemode * 5U);
        } else if((slavemode <= 5U) && (slavemode >= 3U)) {
            TIMERxCFG_temp = (uint32_t)0x1F << ((slavemode * 5U) + 1U);
        } else if((slavemode <= 7U) && (slavemode >= 6U)) {
            TIMERxCFG_temp = (uint32_t)0x1F << ((slavemode - 6U) * 5U);
        } else if((slavemode <= 11U) && (slavemode >= 9U)) {
            TIMERxCFG_temp = (uint32_t)0x1F << (((slavemode - 6U) * 5U) + 1U);
        } else if((slavemode <= 14U) && (slavemode >= 12U)) {
            TIMERxCFG_temp = (uint32_t)0x1F << (((slavemode - 12U) * 5U));
        } else if(slavemode == 15U) {
            TIMERxCFG_temp = (uint32_t)0x1F << (((slavemode - 12U) * 5U) + 1U);
        } else {

        }
    } else {
        if((SYSCFG_TIMERCFG0(TIMERx_temp) & 0x7FFF7FFFU) != 0U) {
            for(i = 0U; i < 3U; i++) {
                if((SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0, 4) << (i * 5U))) != 0U) {
                    trigger_temp = (SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0, 4) << (i * 5U))) >> (i * 5U);
                    SYSCFG_TIMERCFG0(TIMERx_temp) = 0U;
                    break;
                }
            }
            for(i = 3U; i < 6U; i++) {
                if((SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0, 4) << ((i * 5U) + 1U))) != 0U) {
                    trigger_temp = (SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0, 4) << ((i * 5U) + 1U))) >> ((i * 5U) + 1U);
                    SYSCFG_TIMERCFG0(TIMERx_temp) = 0U;
                    break;
                }
            }
        } else if((SYSCFG_TIMERCFG1(TIMERx_temp) & 0x7FFF03FFU) != 0U) {
            for(i = 6U; i < 8U; i++) {
                if((SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0, 4) << ((i - 6U) * 5U))) != 0U) {
                    trigger_temp = (SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0, 4) << ((i - 6U) * 5U))) >> ((i - 6U) * 5U);
                    SYSCFG_TIMERCFG1(TIMERx_temp) = 0U;
                    break;
                }
            }
            for(i = 9U; i < 12U; i++) {
                if((SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0, 4) << ((i - 6U) * 5U + 1U))) != 0U) {
                    trigger_temp = (SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0, 4) << ((i - 6U) * 5U + 1U))) >> ((i - 6U) * 5U + 1U);
                    SYSCFG_TIMERCFG1(TIMERx_temp) = 0U;
                    break;
                }
            }
        } else {
            for(i = 12U; i < 15U; i++) {
                if((SYSCFG_TIMERCFG2(TIMERx_temp) & (BITS(0, 4) << ((i - 12U) * 5U))) != 0U) {
                    trigger_temp = (SYSCFG_TIMERCFG2(TIMERx_temp) & (BITS(0, 4) << ((i - 12U) * 5U))) >> ((i - 12U) * 5U);
                    SYSCFG_TIMERCFG2(TIMERx_temp) = 0U;
                    break;
                }
            }
            if((SYSCFG_TIMERCFG2(TIMERx_temp) & (BITS(0, 4) << 16U)) != 0U) {
                trigger_temp = (SYSCFG_TIMERCFG2(TIMERx_temp) & (BITS(0, 4) << 16U)) >> 16U;
                SYSCFG_TIMERCFG2(TIMERx_temp) = 0U;
            }
        }

        if(slavemode <= 2U) {
            TIMERxCFG_temp = trigger_temp << (slavemode * 5U);
        } else if((slavemode <= 5U) && (slavemode >= 3U)) {
            TIMERxCFG_temp = trigger_temp << ((slavemode * 5U) + 1U);
        } else if((slavemode <= 7U) && (slavemode >= 6U)) {
            TIMERxCFG_temp = trigger_temp << ((slavemode - 6U) * 5U);
        } else if((slavemode <= 11U) && (slavemode >= 9U)) {
            TIMERxCFG_temp = trigger_temp << (((slavemode - 6U) * 5U) + 1U);
        } else if((slavemode <= 14U) && (slavemode >= 12U)) {
            TIMERxCFG_temp = trigger_temp << (((slavemode - 12U) * 5U));
        } else if(slavemode == 15U) {
            TIMERxCFG_temp = trigger_temp << (((slavemode - 12U) * 5U) + 1U);
        } else {

        }
    }

    if(slavemode <= 5U) {
        TIMERxCFG_addr = &SYSCFG_TIMERCFG0(TIMERx_temp);
        REG32(TIMERxCFG_addr) = TIMERxCFG_temp;
    } else if(((slavemode >= 6U) && (slavemode <= 7U)) || ((slavemode >= 9U) && (slavemode <= 11U))) {
        TIMERxCFG_addr = &SYSCFG_TIMERCFG1(TIMERx_temp);
        REG32(TIMERxCFG_addr) = TIMERxCFG_temp;
    } else if((slavemode >= 12U) && (slavemode <= 15U)) {
        TIMERxCFG_addr = &SYSCFG_TIMERCFG2(TIMERx_temp);
        REG32(TIMERxCFG_addr) = TIMERxCFG_temp;
    } else {

    }
}

/*!
    \brief      configure TIMER master slave mode (API_ID(0x003FU))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,30,31,40~44)
    \param[in]  masterslave: master slave mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MASTER_SLAVE_MODE_ENABLE: master slave mode enable
      \arg        TIMER_MASTER_SLAVE_MODE_DISABLE: master slave mode disable
    \param[out] none
    \retval     none
*/
void timer_master_slave_mode_config(uint32_t timer_periph, uint32_t masterslave)
{
    if(TIMER_MASTER_SLAVE_MODE_ENABLE == masterslave) {
        TIMER_SMCFG(timer_periph) |= (uint32_t)TIMER_SMCFG_MSM;
    } else if(TIMER_MASTER_SLAVE_MODE_DISABLE == masterslave) {
        TIMER_SMCFG(timer_periph) &= (~(uint32_t)TIMER_SMCFG_MSM);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure TIMER external trigger input (API_ID(0x0040U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[in]  extprescaler: external trigger prescaler
                only one parameter can be selected which is shown as below:
      \arg        TIMER_EXT_TRI_PSC_OFF: no divided
      \arg        TIMER_EXT_TRI_PSC_DIV2: divided by 2
      \arg        TIMER_EXT_TRI_PSC_DIV4: divided by 4
      \arg        TIMER_EXT_TRI_PSC_DIV8: divided by 8
    \param[in]  extpolarity: external trigger polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETP_FALLING: active low or falling edge active
      \arg        TIMER_ETP_RISING: active high or rising edge active
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_trigger_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter)
{
    TIMER_SMCFG(timer_periph) &= (~(uint32_t)(TIMER_SMCFG_ETP | TIMER_SMCFG_ETPSC | TIMER_SMCFG_ETFC));
    TIMER_SMCFG(timer_periph) |= (uint32_t)((extprescaler & TIMER_SMCFG_ETPSC) | (extpolarity & TIMER_SMCFG_ETP));
    TIMER_SMCFG(timer_periph) |= (uint32_t)((extfilter << 8U) & TIMER_SMCFG_ETFC);
}

/*!
    \brief      configure TIMER quadrature decoder mode (API_ID(0x0041U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[in]  decomode: quadrature decoder mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_QUAD_DECODER_MODE0: counter counts on CI0FE0 edge depending on CI1FE1 level
      \arg        TIMER_QUAD_DECODER_MODE1: counter counts on CI1FE1 edge depending on CI0FE0 level
      \arg        TIMER_QUAD_DECODER_MODE2: counter counts on both CI0FE0 and CI1FE1 edges depending on the level of the other input
      \arg        TIMER_QUAD_DECODER_MODE3: counter counts on CI0FE0 edge depending on CI0FE0 level
      \arg        TIMER_QUAD_DECODER_MODE4: counter counts on CI1FE1 edge depending on CI1FE1 level
    \param[in]  ic0polarity: input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: capture rising edge
      \arg        TIMER_IC_POLARITY_FALLING: capture falling edge
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[in]  ic1polarity: input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: capture rising edge
      \arg        TIMER_IC_POLARITY_FALLING: capture falling edge
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[out] none
    \retval     none
*/
void timer_quadrature_decoder_mode_config(uint32_t timer_periph, uint32_t decomode, uint16_t ic0polarity, uint16_t ic1polarity)
{
    /* configure the quadrature decoder mode */
    timer_slave_mode_select(timer_periph, decomode);

    /* configure input capture selection */
    TIMER_CHCTL0(timer_periph) &= (uint32_t)(((~(uint32_t)TIMER_CHCTL0_CH0MS)) & ((~(uint32_t)TIMER_CHCTL0_CH1MS)));
    TIMER_CHCTL0(timer_periph) |= (uint32_t)(TIMER_IC_SELECTION_DIRECTTI | ((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U));
    /* configure channel input capture polarity */
    if((TIMER0  == timer_periph) || (TIMER7  == timer_periph)) {
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P));
    } else if((TIMER1  == timer_periph) || (TIMER2  == timer_periph) || (TIMER3 == timer_periph) || (TIMER4 == timer_periph) || \
              (TIMER22  == timer_periph) || (TIMER23  == timer_periph) || (TIMER30 == timer_periph) || (TIMER31 == timer_periph)) {
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
    } else {
        /* illegal parameters */
    }
    TIMER_CHCTL2(timer_periph) |= (((uint32_t)ic0polarity & (TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P)) | (((uint32_t)ic1polarity << 4U) &
                                   (TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P)));
}

/*!
    \brief      configure TIMER non-quadrature mode (API_ID(0x0042U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[in]  decomode: decoder mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_NONQUAD_DECODER_MODE0: non-quadrature mode 0
      \arg        TIMER_NONQUAD_DECODER_MODE1: non-quadrature mode 1
      \arg        TIMER_NONQUAD_DECODER_MODE2: non-quadrature mode 2
      \arg        TIMER_NONQUAD_DECODER_MODE3: non-quadrature mode 3
    \param[in]  ic0polarity: input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: capture rising edge
      \arg        TIMER_IC_POLARITY_FALLING: capture falling edge
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[in]  ic1polarity: input capture polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: capture rising edge
      \arg        TIMER_IC_POLARITY_FALLING: capture falling edge
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[out] none
    \retval     none
*/
void timer_non_quadrature_decoder_mode_config(uint32_t timer_periph, uint32_t decomode, uint16_t ic0polarity, uint16_t ic1polarity)
{
    /* configure the non-quadrature decoder mode */
    timer_slave_mode_select(timer_periph, decomode);

    /* configure input capture selection */
    TIMER_CHCTL0(timer_periph) &= (uint32_t)(((~(uint32_t)TIMER_CHCTL0_CH0MS)) & ((~(uint32_t)TIMER_CHCTL0_CH1MS)));
    TIMER_CHCTL0(timer_periph) |= (uint32_t)(TIMER_IC_SELECTION_DIRECTTI | ((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U));
    /* configure channel input capture polarity */
    if((TIMER0  == timer_periph) || (TIMER7  == timer_periph)) {
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P));
    } else if((TIMER1  == timer_periph) || (TIMER2  == timer_periph) || (TIMER3 == timer_periph) || (TIMER4 == timer_periph) || \
              (TIMER22  == timer_periph) || (TIMER23  == timer_periph) || (TIMER30 == timer_periph) || (TIMER31 == timer_periph)) {
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
    } else {
        /* illegal parameters */
    }
    TIMER_CHCTL2(timer_periph) |= (((uint32_t)ic0polarity & (TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P)) | (((uint32_t)ic1polarity << 4U) &
                                   (TIMER_CHCTL2_CH1P | TIMER_CHCTL2_MCH1P)));
}

/*!
    \brief      configure TIMER internal clock mode (API_ID(0x0043U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,30,31,40~44)
    \param[out] none
    \retval     none
*/
void timer_internal_clock_config(uint32_t timer_periph)
{
    timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_DISABLE);
}

/*!
    \brief      configure TIMER the internal trigger as external clock input (API_ID(0x0044U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,30,31,40~44)
    \param[in]  intrigger: internal trigger selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_ITI0: internal trigger 0(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_SMCFG_TRGSEL_ITI1: internal trigger 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_SMCFG_TRGSEL_ITI2: internal trigger 2(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_SMCFG_TRGSEL_ITI3: internal trigger 3(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI4: internal trigger 4 for General-L0 timer(TIMERx(x=1,2,22,23,30,31))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI5: internal trigger 5 for General-L0 timer(TIMERx(x=1,22,23,30))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI7: internal trigger 7 for General-L0 timer(TIMERx(x=4))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI9: internal trigger 9 for General-L0 timer(TIMERx(x=22,23))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI10: internal trigger 10 for General-L0 timer(TIMERx(x=22,23))
      \arg        TIMER_L0_SMCFG_TRGSEL_ITI11: internal trigger 11 for General-L0 timer(TIMERx(x=22,23))
      \arg        TIMER_SMCFG_TRGSEL_ITI12: internal trigger 12(TIMERx(x=0~4,7,23,30,31))
      \arg        TIMER_SMCFG_TRGSEL_ITI13: internal trigger 13(TIMERx(x=0~4,7,22,30,31))
      \arg        TIMER_SMCFG_TRGSEL_ITI14: internal trigger 14(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
    \param[out] none
    \retval     none
*/
void timer_internal_trigger_as_external_clock_config(uint32_t timer_periph, uint32_t intrigger)
{
    /* select TIMER slave mode */
    timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_EXTERNAL0);
    /* select TIMER input trigger source */
    timer_input_trigger_source_select(timer_periph, intrigger);
}

