RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_timer.c
/*!
    \brief      configure TIMER channel additional compare value (API_ID(0x0050U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,30,31,40~44))
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23,30,31))
    \param[in]  value: channel additional compare value, 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void timer_channel_additional_compare_value_config(uint32_t timer_periph, uint16_t channel, uint32_t value)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CH0COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CH1COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CH2COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CH3COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel additional output shadow function (API_ID(0x0051U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,22,23,30,31,40~44)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,22,23,30,31,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23,30,31))
    \param[in]  aocshadow: channel additional output compare shadow
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ADD_SHADOW_ENABLE: channel additional compare output shadow enable
      \arg        TIMER_ADD_SHADOW_DISABLE: channel additional compare output shadow disable
    \param[out] none
    \retval     none
*/
void timer_channel_additional_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t aocshadow)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMADDSEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)aocshadow << 28U) & TIMER_CHCTL0_CH0COMADDSEN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMADDSEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)aocshadow << 29U) & TIMER_CHCTL0_CH1COMADDSEN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMADDSEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)aocshadow << 28U) & TIMER_CHCTL1_CH2COMADDSEN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMADDSEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)aocshadow << 29U) & TIMER_CHCTL1_CH3COMADDSEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      select TIMER channel additional output shadow register update source (API_ID(0x0052U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,22,23,30,31,40~44)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,22,23,30,31,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23,30,31))
    \param[in]  update: channel additional output compare shadow update
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ADD_SHADOW_SELECT_UPDATE: channel additional output shadow register update by update event
      \arg        TIMER_ADD_SHADOW_SELECT_CMP_MATCH: channel additional output shadow register update by compare value match
    \param[out] none
    \retval     none
*/
void timer_channel_additional_output_update_select(uint32_t timer_periph, uint16_t channel, uint16_t update)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0ADDUPS);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)(((uint32_t)update) << 26U) & TIMER_CHCTL0_CH0ADDUPS);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1ADDUPS);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)((uint32_t)update) << 27U) & TIMER_CHCTL0_CH1ADDUPS);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2ADDUPS);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)((uint32_t)update) << 26U) & TIMER_CHCTL1_CH2ADDUPS);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3ADDUPS);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)((uint32_t)update) << 27U) & TIMER_CHCTL1_CH3ADDUPS);
        break;
    default:
        break;
    }
}

/*!
    \brief      read TIMER channel additional compare value (API_ID(0x0053U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,30,31,40~44))
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,22,23,30,31))
    \param[out] none
    \retval     value: channel additional compare value, 0~0xFFFFFFFF
*/
uint32_t timer_channel_additional_compare_value_read(uint32_t timer_periph, uint16_t channel)
{
    uint32_t value = 0U;
    switch(channel) {
    case TIMER_CH_0:
        /* read CH0COMV_ADD value */
        value = TIMER_CH0COMV_ADD(timer_periph);
        break;
    case TIMER_CH_1:
        /* read CH1COMV_ADD value */
        value = TIMER_CH1COMV_ADD(timer_periph);
        break;
    case TIMER_CH_2:
        /* read CH2COMV_ADD value */
        value = TIMER_CH2COMV_ADD(timer_periph);
        break;
    case TIMER_CH_3:
        /* read CH3COMV_ADD value */
        value = TIMER_CH3COMV_ADD(timer_periph);
        break;
    default:
        break;
    }
    return value;
}

/*!
    \brief      configure the TIMER break source (API_ID(0x0054U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signals, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BREAK1: BREAK1 input signals, TIMERx(x=0,7)
    \param[in]  break_src: break source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BRKIN0: BRKIN0 alternate function input enable, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BRKIN1: BRKIN1 alternate function input enable, TIMERx(x=0,7)
      \arg        TIMER_BRKIN2: BRKIN2 alternate function input enable, TIMERx(x=0,7)
      \arg        TIMER_BRKCMP0: CMP0 input enable, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BRKCMP1: CMP1 input enable, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BRKHPDF: HPDF input enable, TIMERx(x=0,7,14~16,40~44)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_break_external_source_config(uint32_t timer_periph, uint16_t break_num, uint32_t break_src, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        if(TIMER_BREAK0 == break_num) {
            TIMER_AFCTL0(timer_periph) |= (break_src & TIMER_BREAK_SOURCE_MASK);
        } else if(TIMER_BREAK1 == break_num) {
            TIMER_AFCTL1(timer_periph) |= (break_src & TIMER_BREAK_SOURCE_MASK);
        } else {
            /* illegal parameters */
        }
    } else {
        if(TIMER_BREAK0 == break_num) {
            TIMER_AFCTL0(timer_periph) &= (~(break_src & TIMER_BREAK_SOURCE_MASK));
        } else if(TIMER_BREAK1 == break_num) {
            TIMER_AFCTL1(timer_periph) &= (~(break_src & TIMER_BREAK_SOURCE_MASK));
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure TIMER break polarity (API_ID(0x0055U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signal, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BREAK1: BREAK1 input signal, TIMERx(x=0,7)
    \param[in]  break_src: break source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BRKIN0: BRKIN0 alternate function input enable, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BRKIN1: BRKIN1 alternate function input enable, TIMERx(x=0,7)
      \arg        TIMER_BRKIN2: BRKIN2 alternate function input enable, TIMERx(x=0,7)
      \arg        TIMER_BRKCMP0: CMP0 input enable, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BRKCMP1: CMP1 input enable, TIMERx(x=0,7,14~16,40~44)
    \param[in]  bkinpolarity: break polarity
                only one parameter can be selected which is shown as below:
                  TIMER_BRKIN_POLARITY_LOW: input signal will not be inverted
                  TIMER_BRKIN_POLARITY_HIGH: input signal will be inverted
    \param[out] none
    \retval     none
*/
void timer_break_external_polarity_config(uint32_t timer_periph, uint16_t break_num, uint32_t break_src, uint16_t bkinpolarity)
{
    if(TIMER_BREAK0 == break_num) {
        switch(break_src) {
        case TIMER_BRKIN0:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKIN0P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 16U) & TIMER_BRKIN0P);
            break;
        case TIMER_BRKIN1:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKIN1P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 17U) & TIMER_BRKIN1P);
            break;
        case TIMER_BRKIN2:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKIN2P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 18U) & TIMER_BRKIN2P);
            break;
        case TIMER_BRKCMP0:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKCMP0P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 25U) & TIMER_BRKCMP0P);
            break;
        case TIMER_BRKCMP1:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKCMP1P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 26U) & TIMER_BRKCMP1P);
            break;
        default:
            break;
        }
    } else {
        switch(break_src) {
        case TIMER_BRKIN0:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKIN0P);
            TIMER_AFCTL1(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 16U) & TIMER_BRKIN0P);
            break;
        case TIMER_BRKIN1:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKIN1P);
            TIMER_AFCTL1(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 17U) & TIMER_BRKIN1P);
            break;
        case TIMER_BRKIN2:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKIN2P);
            TIMER_AFCTL1(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 18U) & TIMER_BRKIN2P);
            break;
        case TIMER_BRKCMP0:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKCMP0P);
            TIMER_AFCTL1(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 25U) & TIMER_BRKCMP0P);
            break;
        case TIMER_BRKCMP1:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKCMP1P);
            TIMER_AFCTL1(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 26U) & TIMER_BRKCMP1P);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER break lock function (API_ID(0x0056U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: enable BREAK0 lock function, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BREAK1: enable BREAK1 lock function, TIMERx(x=0,7)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_break_lock_config(uint32_t timer_periph, uint16_t break_num, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK0LK;
        } else {
            TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK1LK;
        }
    } else {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_BRK0LK);
        } else {
            TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_BRK1LK);
        }
    }
}

/*!
    \brief      release the TIMER break lock function (API_ID(0x0057U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: release the BREAK0 lock function, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BREAK1: release the BREAK1 lock function, TIMERx(x=0,7)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_break_lock_release_config(uint32_t timer_periph, uint16_t break_num, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK0REL;
        } else {
            TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK1REL;
        }
    } else {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_BRK0REL);
        } else {
            TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_BRK1REL);
        }
    }
}

/*!
    \brief      configure the TIMER channel break control function (API_ID(0x0058U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_break_control_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_BRKENCH0 << (channel & TIMER_CHANNEL_MASK));
    } else {
        TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_BRKENCH0 << (channel & TIMER_CHANNEL_MASK)));
    }
}

/*!
    \brief      configure the TIMER channel free dead time function (API_ID(0x0059U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_dead_time_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_DTIENCH0 << (channel & TIMER_CHANNEL_MASK));
    } else {
        TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_DTIENCH0 << (channel & TIMER_CHANNEL_MASK)));
    }
}

/*!
    \brief      initialize TIMER channel free complementary parameter struct with a default value (API_ID(0x005AU))
    \param[in]  freecompara: TIMER channel free complementary parameter struct
    \param[out] none
    \retval     none
*/
void timer_free_complementary_struct_para_init(timer_free_complementary_parameter_struct *freecompara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(freecompara)) {
        fw_debug_report_err(TIMER_MODULE_ID, (API_ID(0x005AU)), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the channel free complementary parameter struct member with the default value */
        freecompara->freecomstate = TIMER_FCCHP_STATE_DISABLE;
        freecompara->runoffstate  = TIMER_ROS_STATE_DISABLE;
        freecompara->ideloffstate = TIMER_IOS_STATE_DISABLE;
        freecompara->deadtime     = 0U;
    }
}

/*!
    \brief      configure channel free complementary protection (API_ID(0x005BU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in] fcpara: TIMER channel free complementary parameter struct
                freecomstate: TIMER_FCCHP_STATE_ENABLE, TIMER_FCCHP_STATE_DISABLE
                runoffstate: TIMER_ROS_STATE_ENABLE, TIMER_ROS_STATE_DISABLE
                ideloffstate: TIMER_IOS_STATE_ENABLE, TIMER_IOS_STATE_DISABLE
                deadtime: 0~255
    \param[out] none
    \retval     none
*/
void timer_channel_free_complementary_config(uint32_t timer_periph, uint16_t channel, timer_free_complementary_parameter_struct *fcpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(fcpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, (API_ID(0x005AU)), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        case TIMER_CH_0:
            TIMER_FCCHP0(timer_periph) &= (~(uint32_t)(TIMER_FCCHP0_DTCFG | TIMER_FCCHP0_IOS | TIMER_FCCHP0_ROS | TIMER_FCCHP0_FCCHP0EN));
            TIMER_FCCHP0(timer_periph) |= (fcpara->deadtime & TIMER_FCCHP0_DTCFG);
            TIMER_FCCHP0(timer_periph) |= (fcpara->ideloffstate & TIMER_FCCHP0_IOS);
            TIMER_FCCHP0(timer_periph) |= (fcpara->runoffstate & TIMER_FCCHP0_ROS);
            TIMER_FCCHP0(timer_periph) |= (fcpara->freecomstate & TIMER_FCCHP0_FCCHP0EN);
            break;
        case TIMER_CH_1:
            TIMER_FCCHP1(timer_periph) &= (~(uint32_t)(TIMER_FCCHP1_DTCFG | TIMER_FCCHP1_IOS | TIMER_FCCHP1_ROS | TIMER_FCCHP1_FCCHP1EN));
            TIMER_FCCHP1(timer_periph) |= (fcpara->deadtime & TIMER_FCCHP1_DTCFG);
            TIMER_FCCHP1(timer_periph) |= (fcpara->ideloffstate & TIMER_FCCHP1_IOS);
            TIMER_FCCHP1(timer_periph) |= (fcpara->runoffstate & TIMER_FCCHP1_ROS);
            TIMER_FCCHP1(timer_periph) |= (fcpara->freecomstate & TIMER_FCCHP1_FCCHP1EN);
            break;
        case TIMER_CH_2:
            TIMER_FCCHP2(timer_periph) &= (~(uint32_t)(TIMER_FCCHP2_DTCFG | TIMER_FCCHP2_IOS | TIMER_FCCHP2_ROS | TIMER_FCCHP2_FCCHP2EN));
            TIMER_FCCHP2(timer_periph) |= (fcpara->deadtime & TIMER_FCCHP2_DTCFG);
            TIMER_FCCHP2(timer_periph) |= (fcpara->ideloffstate & TIMER_FCCHP2_IOS);
            TIMER_FCCHP2(timer_periph) |= (fcpara->runoffstate & TIMER_FCCHP2_ROS);
            TIMER_FCCHP2(timer_periph) |= (fcpara->freecomstate & TIMER_FCCHP2_FCCHP2EN);
            break;
        case TIMER_CH_3:
            TIMER_FCCHP3(timer_periph) &= (~(uint32_t)(TIMER_FCCHP3_DTCFG | TIMER_FCCHP3_IOS | TIMER_FCCHP3_ROS | TIMER_FCCHP3_FCCHP3EN));
            TIMER_FCCHP3(timer_periph) |= (fcpara->deadtime & TIMER_FCCHP3_DTCFG);
            TIMER_FCCHP3(timer_periph) |= (fcpara->ideloffstate & TIMER_FCCHP3_IOS);
            TIMER_FCCHP3(timer_periph) |= (fcpara->runoffstate & TIMER_FCCHP3_ROS);
            TIMER_FCCHP3(timer_periph) |= (fcpara->freecomstate & TIMER_FCCHP3_FCCHP3EN);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure the TIMER channel break (API_ID(0x005CU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  breaken: TIMER channel break enable
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_BREAK_ENABLE: channel BREAK input signal enable
      \arg        TIMER_CH_BREAK_DISABLE: channel BREAK input signal disable
    \param[in] breakpolarity: channel BREAK input signal polarity
      \arg        TIMER_CH_BREAK_POLARITY_HIGH: channel BREAK input active high
      \arg        TIMER_CH_BREAK_POLARITY_LOW: channel BREAK input active low
    \param[in] break0filter: 0~15
    \param[out] none
    \retval     none
*/
void timer_channel_break_config(uint32_t timer_periph, uint32_t breaken, uint32_t breakpolarity, uint32_t break0filter)
{
    TIMER_CCHP(timer_periph) &= (~(uint32_t)(TIMER_CCHP_CHBRKEN | TIMER_CCHP_CHBRKP | TIMER_CCHP_BRK0F));
    TIMER_CCHP(timer_periph) |= (uint32_t)((breaken & TIMER_CCHP_CHBRKEN) | (breakpolarity & TIMER_CCHP_CHBRKP) | ((
            break0filter << 16U) & TIMER_CCHP_BRK0F));
}

/*!
    \brief      configure TIMER channel break external input enable (API_ID(0x005DU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_break_external_status_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    switch(channel) {
    case TIMER_CH_0:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH0BRKINEN;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH0BRKINEN);
        }
        break;
    case TIMER_CH_1:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH1BRKINEN;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH1BRKINEN);
        }
        break;
    case TIMER_CH_2:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH2BRKINEN;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH2BRKINEN);
        }
        break;
    case TIMER_CH_3:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH3BRKINEN;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH3BRKINEN);
        }
        break;
    default:
        break;
    }
}

