RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_timer.c
/*!
    \brief      configure TIMER channel break external input polarity (API_ID(0x005EU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  bkinpolarity: channel x BREAK input signal polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CHx_BREAK_IN_INV: channel x BREAK input signal will be inverted
      \arg        TIMER_CHx_BREAK_IN_NOT_INV: channel x BREAK input signal will not be inverted
    \param[out] none
    \retval     none
*/
void timer_channel_break_external_polarity_config(uint32_t timer_periph, uint32_t channel, uint16_t bkinpolarity)
{
    switch(channel) {
    case TIMER_CH_0:
        if(TIMER_CHx_BREAK_IN_INV == bkinpolarity) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH0BRKINP;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH0BRKINP);
        }
        break;
    case TIMER_CH_1:
        if(TIMER_CHx_BREAK_IN_INV == bkinpolarity) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH1BRKINP;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH1BRKINP);
        }
        break;
    case TIMER_CH_2:
        if(TIMER_CHx_BREAK_IN_INV == bkinpolarity) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH2BRKINP;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH2BRKINP);
        }
        break;
    case TIMER_CH_3:
        if(TIMER_CHx_BREAK_IN_INV == bkinpolarity) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH3BRKINP;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH3BRKINP);
        }
        break;
    default:
        break;
    }
}



/*!
    \brief      configure TIMER channel primary output function (API_ID(0x005FU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_primary_output_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    switch(channel) {
    case TIMER_CH_0:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CHPOEN0;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CHPOEN0);
        }
        break;
    case TIMER_CH_1:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CHPOEN1;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CHPOEN1);
        }
        break;
    case TIMER_CH_2:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CHPOEN2;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CHPOEN2);
        }
        break;
    case TIMER_CH_3:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CHPOEN3;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CHPOEN3);
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel break period value (API_ID(0x0060U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  value: channel break period value, 0~0xFFFF
    \param[out] none
    \retval     none
*/
void timer_channel_break_period_config(uint32_t timer_periph, uint16_t value)
{
    TIMER_CHBRKPER(timer_periph) = (uint32_t)value;
}

/*!
    \brief      configure quadrature decoder signal disconnection detection watchdog value (API_ID(0x0061U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[in]  value: watchdog counter period value, 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void timer_watchdog_value_config(uint32_t timer_periph, uint32_t value)
{
    TIMER_WDGPER(timer_periph) = value;
}

/*!
    \brief      read quadrature decoder signal disconnection detection watchdog value (API_ID(0x0062U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[out] none
    \retval     watchdog counter period register value, 0~0xFFFFFFFF
*/
uint32_t timer_watchdog_value_read(uint32_t timer_periph)
{
    return (TIMER_WDGPER(timer_periph));
}

/*!
    \brief      configure quadrature decoder signal disconnection detection function (API_ID(0x0063U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_decoder_disconnection_detection_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= TIMER_DECDISCONNECTDEN;
    } else {
        TIMER_CTL2(timer_periph) &= (~TIMER_DECDISCONNECTDEN);
    }
}

/*!
    \brief      configure quadrature decoder signal jump detection function (API_ID(0x0064U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_decoder_jump_detection_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= TIMER_DECJUMPDEN;
    } else {
        TIMER_CTL2(timer_periph) &= (~TIMER_DECJUMPDEN);
    }
}

/*!
    \brief      configure the UPIF bit backup function (API_ID(0x0065U))
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_upif_backup_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_UPIFBUEN;
    } else {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPIFBUEN);
    }
}

/*!
    \brief      get the UPIFBU bit in the TIMERx_CNT register (API_ID(0x0066U))
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[out] none
    \retval     UPIFBUStatus: VALID_SET or VALID_RESET or INVALID
      \ret        VALID_SET: the UPIFBU is valid and value is 1
      \ret        VALID_RESET: the UPIFBU is valid and value is 0
      \ret        INVALID: the UPIFBU is invalid
*/
UPIFBUStatus timer_upifbu_bit_get(uint32_t timer_periph)
{
    UPIFBUStatus ret = VALID_RESET;
    if((TIMER_CTL0(timer_periph) & TIMER_CTL0_UPIFBUEN)) {
        if((TIMER50 == timer_periph) || (TIMER51 == timer_periph)) {
            if(TIMER_CNTH(timer_periph) & TIMER_CNT_UPIFBU) {
                ret = VALID_SET;
            } else {
                ret = VALID_RESET;
            }
        } else {
            if(TIMER_CNT(timer_periph) & TIMER_CNT_UPIFBU) {
                ret = VALID_SET;
            } else {
                ret = VALID_RESET;
            }
        }
    } else {
        ret = INVALID;
    }
    return ret;
}

/*!
    \brief      get TIMER flags (API_ID(0x0067U))
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[in]  flag: the TIMER flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag, TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
      \arg        TIMER_FLAG_CH0: channel 0 capture or compare flag, TIMERx(x=0~4,7,14~16,22,23,30,31,40~44)
      \arg        TIMER_FLAG_CH1: channel 1 capture or compare flag, TIMERx(x=0~4,7,14,22,23,30,31,40~44)
      \arg        TIMER_FLAG_CH2: channel 2 capture or compare flag, TIMERx(x=0~4,7,22,23,30,31)
      \arg        TIMER_FLAG_CH3: channel 3 capture or compare flag, TIMERx(x=0~4,7,22,23,30,31)
      \arg        TIMER_FLAG_CMT: channel commutation flag, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_FLAG_TRG: trigger flag, TIMERx(x=0~4,7,14,22,23,30,31,40~44)
      \arg        TIMER_FLAG_BRK0: BREAK0 flag, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_FLAG_BRK1: BREAK1 flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag, TIMERx(x=0~4,7,14~16,22,23,30,31,40~44)
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag, TIMERx(x=0~4,7,14,22,23,30,31,40~44)
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag, TIMERx(x=0~4,7,22,23,30,31)
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag, TIMERx(x=0~4,7,22,23,30,31)
      \arg        TIMER_FLAG_SYSB: system source break flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_DECJ: quadrature decoder signal jump flag, TIMERx(x=0~4,7,22,23,30,31)
      \arg        TIMER_FLAG_DECDIS: quadrature decoder signal disconnection flag, TIMERx(x=0~4,7,22,23,30,31)
      \arg        TIMER_FLAG_MCH0: multi mode channel 0 capture or compare flag, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_FLAG_MCH1: multi mode channel 1 capture or compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH2: multi mode channel 2 capture or compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH3: multi mode channel 3 capture or compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH0O: multi mode channel 0 overcapture flag, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_FLAG_MCH1O: multi mode channel 1 overcapture flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH2O: multi mode channel 2 overcapture flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_MCH3O: multi mode channel 3 overcapture flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH0COMADD: channel 0 additional compare flag, TIMERx(x=0~4,7,14,22,23,30,31)
      \arg        TIMER_FLAG_CH1COMADD: channel 1 additional compare flag, TIMERx(x=0~4,7,14,22,23,30,31)
      \arg        TIMER_FLAG_CH2COMADD: channel 2 additional compare flag, TIMERx(x=0~4,7,22,23,30,31)
      \arg        TIMER_FLAG_CH3COMADD: channel 3 additional compare flag, TIMERx(x=0~4,7,22,23,30,31)
      \arg        TIMER_FLAG_CH0BRKM: channel 0 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH1BRKM: channel 1 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH2BRKM: channel 2 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH3BRKM: channel 3 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH0BRK: channel 0 BREAK interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH1BRK: channel 1 BREAK interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH2BRK: channel 2 BREAK interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH3BRK: channel 3 BREAK interrupt flag, TIMERx(x=0,7)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_flag_get(uint32_t timer_periph, timer_flag_enum flag)
{
    FlagStatus ret = RESET;

